Repository: Abdelrahman-Hussen/Mini-Portfolio-Web-API
Catalog: Portfolio.Common/Resources/Message.*.resx
Languages: ar

# Error_Category_Not_Found
source: Category not found
ar: لم يتم العثور على الفئة

# Error_General
source: an error occured
ar: حدث خطأ

# Error_InactiveRefreshToken
source: inactive refresh token
ar: رمز التحديث غير النشط

# Error_InvalidRefreshToken
source: invalid refresh token
ar: رمز التحديث غير صالح

# Error_Login
source: Wrong Email or Password
ar: البريد الإلكتروني أو كلمة المرور خاطئة

# Error_NotFound
source: item not found
ar: غير موجود

# Error_NotSupportedExtantion
source: Not Supported Extantion
ar: صيغة غير مدعومة

# Error_OTPExpired
source: OTP is expired
ar: انتهت صلاحية ال OTP

# Error_OTPWrong
source: OTP is Wrong
ar: رمز ال OTP خطأ

# Error_Product_Not_Found
source: Product not found
ar: المنتج غير موجود

# Error_RateLimit
source: The rate must be between 0 and 5
ar: التقييم يجب ان يكون بين ال 0 و ال 5

# Error_RequiredField
source: This Field is required
ar: هذا الحقل مطلوب

# Error_TranslatableContent
source: Error in translatable content
ar: خطأ في المحتوى القابل للترجمة

# Error_UserEmailExist
source: email already in use
ar: البريد الإلكتروني مستخدم من قبل

# Error_UserEmailNotExist
source: email is not exist
ar: البريد الإلكتروني غير موجود

# Error_UserNameExist
source: userName already in use
ar: اسم المستخدم مستخدم من قبل

# Error_UserPhoneExist
source: phone number already in use
ar: رقم الهاتف مستخدم من قبل

# IdentityError_DefaultIdentityError
source: Identity system error
ar: حدث خطأ في نظام التسجيل

# IdentityError_DuplicateEmail
source: Email '{0}' already exists
ar: عنوان البريد الإلكتروني '{0}' موجود مسبقا

# IdentityError_DuplicateRoleName
source: Role name '{0}' already exists
ar: اسم المهمة '{0}' موجود مسبقا

# IdentityError_DuplicateUserName
source: User name '{0}' already exists
ar: اسم المستخدم '{0}' موجود مسبقا

# IdentityError_InvalidEmail
source: Email '{0} is invalid
ar: عنوان البريد الإلكتروني '{0}' غير مقبول

# IdentityError_InvalidRoleName
source: Role name '{0}' is invalid
ar: اسم المهمة '{0}' غير مقبول

# IdentityError_InvalidUserName
source: User name '{0}' is invalid
ar: اسم المستخدم '{0}' غير مقبول

# IdentityError_PasswordMismatch
source: The provided password dosen't match your saved password
ar: كلمة السر لا تشابه كلمة السر المحفوظة في حسابك

# IdentityError_PasswordRequiresDigit
source: The password must contain digits (0-9)
ar: يجب أن تحتوي كلمة السر على أرقام (0 - 9)

# IdentityError_PasswordRequiresLower
source: The password must contain lower case letters (a - z)
ar: يجب أن تحتوي كلمة السر على أحرف صغيرة (2 - 1)

# IdentityError_PasswordRequiresNonAlphanumeric
source: The password must contain non-alphanumeric char (. ! + ? ...)
ar: يجب أن تحتوي كلمة السر على رموز غير حرف - رقمية (. ! + ? ...)

# IdentityError_PasswordRequiresUniqueChars
source: The password must contain '{0}' unique chracters
ar: يجب أن تحتوي كلمة السر على '{0}' أحرف غير متشابهة على الأقل

# IdentityError_PasswordRequiresUpper
source: The password must contain lower case letters (A - Z)
ar: يجب أن تحتوي كلمة السر على أحرف كبيرة (A - Z)

# IdentityError_PasswordTooShort
source: The password must be at least '{0}' character long
ar: يجب أن يكون كول كلمة السر '{0}' أحرف على الأقل

# IdentityError_UserAlreadyInRole
source: The user is already in '{0}' role
ar: المستخدم موجود مسبقا في المهمة '{0}'

# IdentityError_UserNotinRole
source: User is not in '{0}' role
ar: ليس للمستخدم صلاحية المهمة '{0}'

# Success_General
source: success
ar: تمت العملية بنجاح
